Центр_управления_производительностью_демо/src/Catalogs/АгентыЦКК/АгентыЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АгентыЦКК</name>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтправкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестСбораСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторАгента</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторАгентаСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Хост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/InformationRegisters/АктивностьАгентовЦКК/АктивностьАгентовЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивностьАгентовЦКК</name>
  <attributes>
    <name>ДатаКрайнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>АгентЦКК</name>
    <type>
      <types>CatalogRef.АгентыЦКК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Центр_управления_производительностью_демо/src/InformationRegisters/КомандыАгентаЦКК/КомандыАгентаЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомандыАгентаЦКК</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Команда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>АгентЦКК</name>
    <type>
      <types>CatalogRef.АгентыЦКК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКоманды</name>
    <type>
      <types>EnumRef.ТипыКомандАгентаЦКК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКоманды</name>
    <type>
      <types>EnumRef.СтатусыКомандАгентаЦКК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Центр_управления_производительностью_демо/src/Enums/ТипыКомандАгентаЦКК/ТипыКомандАгентаЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомандАгентаЦКК</name>
  <enumValues>
    <name>RemoteControl</name>
  </enumValues>
  <enumValues>
    <name>PerfomanceMonitor</name>
  </enumValues>
</mdclass:Enum>

Центр_управления_производительностью_демо/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>Наполнитель</name>
      <description>Наполнитель</description>
    </items>
  </predefined>
  <attributes>
    <name>COMКоннекторЗарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБД</name>
    <comment>Имя базы данных на сервере СУБД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБ</name>
    <comment>Имя информационной базы в кластере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПП1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализВзаимоблокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализГранулярностиБлокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализОжиданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализСерверныхВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСВзаимоблокировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСТаймауты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПППроизвольныеСчетчикиОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиЛокальный</name>
    <comment>Локальный для сервера СУБД каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиСетевой</name>
    <comment>Сетевой каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВерсииСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенаРольProcessAdmin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настроено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтладочныеСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортЦентральногоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУправленияБлокировкойДанных</name>
    <type>
      <types>EnumRef.РежимыУправленияБлокировкойДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <comment>Кластер серверов 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособАутентификации</name>
    <type>
      <types>EnumRef.СпособыАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОССервераСУБД</name>
    <type>
      <types>EnumRef.ТипыОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьТрассировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИменаКаталоговТЖ</name>
    <attributes>
      <name>СерверКластера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <comment>Полный путь файла logcfg.xml</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Локальный</name>
      <comment>Локальный для сервера 1С:Предприятия каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сетевой</name>
      <comment>Сетевой каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серверы</name>
    <attributes>
      <name>АгентЦКК</name>
      <type>
        <types>CatalogRef.АгентыЦКК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособСбораСчетчиков</name>
      <type>
        <types>EnumRef.СпособыСбораСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯзыкОС</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыШагов</name>
    <attributes>
      <name>ИмяШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыШаговМастераНастройки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиОС</name>
    <attributes>
      <name>НомерСтрокиСервера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/АгентыЦКК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

// Выполняет поиск по реквизиту УникальныйИдентификаторАгента 
//
// Параметры:
//  УникальныйИдентификаторАгента - УникальныйИдентификатор - значение, по которому выполняется поиск. 
// 
// Возвращаемое значение:
//  Структура с ключами - Ссылка - СправочникСсылка.АгентыЦКК
//                      - ДатаАктивности - Дата
//
Функция НайтиПоУникальномуИдентификатору(УникальныйИдентификаторАгента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Агенты.Ссылка КАК Ссылка,
	               |	Агенты.Версия КАК Версия,
	               |	ЕСТЬNULL(Активность.ДатаКрайнейАктивности, &ПустаяДата) КАК ДатаАктивности,
	               |	Агенты.ПериодОтправкиДанных КАК ПериодОтправкиДанных,
	               |	Агенты.Хост КАК Хост
	               |ИЗ
	               |	Справочник.АгентыЦКК КАК Агенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктивностьАгентовЦКК КАК Активность
	               |		ПО (Активность.АгентЦКК = Агенты.Ссылка)
	               |ГДЕ
	               |	Агенты.УникальныйИдентификаторАгента = &УникальныйИдентификаторАгента";
	
	Запрос.УстановитьПараметр("УникальныйИдентификаторАгента", УникальныйИдентификаторАгента);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	
	Результат = Запрос.Выполнить();
	
	АгентЦКК = Новый Структура();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Для Каждого Колонка Из Результат.Колонки Цикл
			АгентЦКК.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
	Иначе
		Для Каждого Колонка Из Результат.Колонки Цикл
			АгентЦКК.Вставить(Колонка.Имя, Неопределено);
		КонецЦикла;        
	КонецЕсли;
	
	Возврат АгентЦКК;
	
КонецФункции

// Создает новый элемент по реквизиту УникальныйИдентификаторАгента в случае отсутствия.
//
// Параметры:
//  УникальныйИдентификаторАгента - УникальныйИдентификатор - уникальный идентификатор агента для создания. 
// 
// Возвращаемое значение:
//  СправочникСсылка.АгентыЦКК
//
Функция СоздатьЭлементПоУникальномуИдентификатору(УникальныйИдентификаторАгента, Хост, Версия) Экспорт
    
    АгентЦККСтруктура = НайтиПоУникальномуИдентификатору(УникальныйИдентификаторАгента);
    АгентЦКК = АгентЦККСтруктура.Ссылка;
    
    Если АгентЦКК = Неопределено Тогда
        
        НачатьТранзакцию();
        Попытка
            
            Блокировка = Новый БлокировкаДанных;
            ЭлементБлокировки = Блокировка.Добавить("Справочник.АгентыЦКК");
            ЭлементБлокировки.УстановитьЗначение("УникальныйИдентификаторАгента", УникальныйИдентификаторАгента);
            ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
            Блокировка.Заблокировать();
            
            АгентЦККСтруктура = НайтиПоУникальномуИдентификатору(УникальныйИдентификаторАгента);
            АгентЦКК = АгентЦККСтруктура.Ссылка;
            Если АгентЦКК = Неопределено Тогда
                
                АгентЦККОбъект = Справочники.АгентыЦКК.СоздатьЭлемент();
                АгентЦККОбъект.Наименование = Хост;
                АгентЦККОбъект.Версия = Версия;
                АгентЦККОбъект.УникальныйИдентификаторАгента = УникальныйИдентификаторАгента;
                АгентЦККОбъект.Хост = Хост;
                АгентЦККОбъект.ДатаРегистрации = ТекущаяУниверсальнаяДата();
                АгентЦККОбъект.Заполнить(Неопределено);
                АгентЦККОбъект.Записать();
                
            КонецЕсли;
            
            ЗафиксироватьТранзакцию();
            
            АгентЦКК = АгентЦККОбъект.Ссылка; 
                        
        Исключение
            
            ОтменитьТранзакцию();
            ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            
        КонецПопытки;
        
    ИначеЕсли АгентЦКК.Версия  <> Версия Тогда
        
        АгентЦККОбъект = АгентЦКК.ПолучитьОбъект();
        АгентЦККОбъект.Версия = Версия;
        АгентЦККОбъект.Записать();        
        
    КонецЕсли;
    
    Возврат АгентЦКК;
    
КонецФункции

Процедура ВключитьСборСчетчиковПроизводительности(АгентЦКК, СобираемыеСчетчики = Неопределено) Экспорт
	
	Если СобираемыеСчетчики = Неопределено Тогда
		СобираемыеСчетчики = Справочники.ИнформационныеБазы.ПолучитьСчетчикиАгента(АгентЦКК);
	КонецЕсли;
	НастройкиАгента = Новый Соответствие;
	НастройкиАгента.Вставить("enable", Истина);
	НастройкиАгента.Вставить("counters", СобираемыеСчетчики);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, НастройкиАгента);
	РегистрыСведений.КомандыАгентаЦКК.ДобавитьКоманду(АгентЦКК, Перечисления.ТипыКомандАгентаЦКК.PerfomanceMonitor, НастройкиАгента); 
	
КонецПроцедуры

Процедура ОтключитьСборСчетчиковПроизводительности(АгентЦКК) Экспорт
	
	НастройкиАгента = Новый Соответствие;
	НастройкиАгента.Вставить("enable", Ложь);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, НастройкиАгента);
	РегистрыСведений.КомандыАгентаЦКК.ДобавитьКоманду(АгентЦКК, Перечисления.ТипыКомандАгентаЦКК.PerfomanceMonitor, НастройкиАгента); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
